In [10]:
import pandas as pd
import numpy as np

In [11]:
dic = {"name":["krishnendu","sunny","rohan","rahul","sriti","Geeta"],"salary":[1000,1001,1002,1003,1004,1005]
       ,"city":['ranaghat','kolkata','beherampur','bongaon','howrah','hoogly']}

In [12]:
df = pd.DataFrame(dic)
df

         name  salary        city
0  krishnendu    1000    ranaghat
1       sunny    1001     kolkata
2       rohan    1002  beherampur
3       rahul    1003     bongaon
4       sriti    1004      howrah
5       Geeta    1005      hoogly